app/controllers/perfil_controller.rb

  def show
  	@profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
  	@profile = Profile.new(perfil_params)
  	if @profile.save
---
INSERT INTO "profiles" ("name", "profession", "age", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "juan"], ["profession", "tsu"], ["age", 25], ["created_at", 2016-12-27 17:51:34 UTC], ["updated_at", 2016-12-27 17:51:34 UTC]]

  def edit
  	@profile = Profile.find(params[:id])
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  	@profile = Profile.find(params[:id])
  	if @profile.update(perfil_params)
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "profiles" SET "name" = ?, "updated_at" = ? WHERE "profiles"."id" = ?  [["name", "editar"], ["updated_at", 2016-12-28 17:06:45 UTC], ["id", 15]]

  def destroy
  	@profile = Profile.find(params[:id])
  	@profile.destroy
---
SELECT  "profiles".* FROM "profiles" WHERE "profiles"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "profiles" WHERE "profiles"."id" = ?  [["id", 5]]